
## :white_check_mark: Apply Result

[CI link](https://github.com/mizzy/sakura-cloud-education-touch-demo/actions/runs/1512283059)

<pre><code>Apply complete! Resources: 2 added, 0 changed, 0 destroyed.</code></pre>

<details><summary>Details (Click me)</summary>

```hcl
aws_vpc.ecs_sample: Refreshing state... [id=vpc-05fa6437d1950b505]
aws_s3_bucket.alb_log: Refreshing state... [id=alb-log-of-ecs-sample]
module.https_sg.aws_security_group.default: Refreshing state... [id=sg-0d03c39c130171a25]
aws_route_table.private0: Refreshing state... [id=rtb-04c52d0c2f4f6fb3e]
aws_route_table.public: Refreshing state... [id=rtb-02b3748a419fb2683]
aws_subnet.private1: Refreshing state... [id=subnet-0b80416f81081f9d5]
module.http_sg.aws_security_group.default: Refreshing state... [id=sg-0be58c4f1a48c6129]
aws_internet_gateway.igw: Refreshing state... [id=igw-0e1685b83df866267]
aws_subnet.public1: Refreshing state... [id=subnet-0e4d908c8b6012cf4]
aws_subnet.public0: Refreshing state... [id=subnet-02d54a30d5f61210a]
aws_route_table.private1: Refreshing state... [id=rtb-0eed5c91cda4b3acc]
aws_subnet.private0: Refreshing state... [id=subnet-0360de0228650800c]
module.http_sg.aws_security_group_rule.ingress: Refreshing state... [id=sgrule-1740198367]
module.http_sg.aws_security_group_rule.egress: Refreshing state... [id=sgrule-4215454654]
aws_route_table_association.public0: Refreshing state... [id=rtbassoc-00ef7c2460170cd58]
aws_route_table_association.private1: Refreshing state... [id=rtbassoc-03c410620e7b366e5]
module.https_redirect_sg.aws_security_group.default: Refreshing state... [id=sg-0811d352871ab950e]
module.https_sg.aws_security_group_rule.egress: Refreshing state... [id=sgrule-701884444]
module.https_sg.aws_security_group_rule.ingress: Refreshing state... [id=sgrule-1132770594]
aws_eip.ngw1: Refreshing state... [id=eipalloc-0db2eac64498abb7a]
aws_route.public: Refreshing state... [id=r-rtb-02b3748a419fb26831080289494]
aws_eip.ngw0: Refreshing state... [id=eipalloc-04e367929021a68b1]
aws_route_table_association.public1: Refreshing state... [id=rtbassoc-0b0139d2ccca64f23]
aws_route_table_association.private0: Refreshing state... [id=rtbassoc-0104951db21990e4a]
module.https_redirect_sg.aws_security_group_rule.ingress: Refreshing state... [id=sgrule-2663386237]
module.https_redirect_sg.aws_security_group_rule.egress: Refreshing state... [id=sgrule-1723817718]
aws_nat_gateway.ngw1: Refreshing state... [id=nat-0a57b2a380445c52a]
aws_nat_gateway.ngw0: Refreshing state... [id=nat-07c363cea9ebe7c20]
aws_route.private1: Refreshing state... [id=r-rtb-0eed5c91cda4b3acc1080289494]
aws_route.private0: Refreshing state... [id=r-rtb-04c52d0c2f4f6fb3e1080289494]
aws_s3_bucket_policy.alb_log: Refreshing state... [id=alb-log-of-ecs-sample]
aws_lb.sample: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:722557045766:loadbalancer/app/sample/2aef9e53f7888967]
aws_route53_record.sample: Refreshing state... [id=Z07054061YZ4SIOQH4B64_sakura-cloud-education-touch-demo.com_A]
aws_lb_target_group.sample: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:722557045766:targetgroup/sample/2ac5a7a4fd71cf94]
aws_acm_certificate.sample: Refreshing state... [id=arn:aws:acm:ap-northeast-1:722557045766:certificate/697fc502-eafd-4545-9c78-5a56899f47bd]
aws_route53_record.sample_cert_validation: Refreshing state... [id=Z07054061YZ4SIOQH4B64__67eb6117e9f97e2a75b4417b0fa42f19.sakura-cloud-education-touch-demo.com._CNAME]
aws_acm_certificate_validation.sample: Refreshing state... [id=2021-11-28 08:47:09 +0000 UTC]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # module.https_redirect_sg.aws_security_group_rule.ingress has been changed
  ~ resource "aws_security_group_rule" "ingress" {
        id                = "sgrule-2663386237"
      + ipv6_cidr_blocks  = []
      + prefix_list_ids   = []
        # (7 unchanged attributes hidden)
    }
  # module.https_redirect_sg.aws_security_group.default has been changed
  ~ resource "aws_security_group" "default" {
      ~ egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
        id                     = "sg-0811d352871ab950e"
      ~ ingress                = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 8080
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 8080
            },
        ]
        name                   = "http-redirect-sg"
      + tags                   = {}
        # (6 unchanged attributes hidden)
    }
  # module.https_redirect_sg.aws_security_group_rule.egress has been changed
  ~ resource "aws_security_group_rule" "egress" {
        id                = "sgrule-1723817718"
      + ipv6_cidr_blocks  = []
      + prefix_list_ids   = []
        # (7 unchanged attributes hidden)
    }
  # module.https_sg.aws_security_group.default has been changed
  ~ resource "aws_security_group" "default" {
      ~ egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
        id                     = "sg-0d03c39c130171a25"
      ~ ingress                = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 443
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 443
            },
        ]
        name                   = "https-sg"
      + tags                   = {}
        # (6 unchanged attributes hidden)
    }
  # module.https_sg.aws_security_group_rule.egress has been changed
  ~ resource "aws_security_group_rule" "egress" {
        id                = "sgrule-701884444"
      + ipv6_cidr_blocks  = []
      + prefix_list_ids   = []
        # (7 unchanged attributes hidden)
    }
  # module.https_sg.aws_security_group_rule.ingress has been changed
  ~ resource "aws_security_group_rule" "ingress" {
        id                = "sgrule-1132770594"
      + ipv6_cidr_blocks  = []
      + prefix_list_ids   = []
        # (7 unchanged attributes hidden)
    }
  # aws_s3_bucket_policy.alb_log has been changed
  ~ resource "aws_s3_bucket_policy" "alb_log" {
        id     = "alb-log-of-ecs-sample"
      ~ policy = jsonencode(
          ~ {
              ~ Statement = [
                  ~ {
                      ~ Principal = {
                          ~ AWS = "582318560864" -> "arn:aws:iam::582318560864:root"
                        }
                        # (4 unchanged elements hidden)
                    },
                ]
                # (1 unchanged element hidden)
            }
        )
        # (1 unchanged attribute hidden)
    }
  # aws_route53_record.sample has been changed
  ~ resource "aws_route53_record" "sample" {
        id      = "Z07054061YZ4SIOQH4B64_sakura-cloud-education-touch-demo.com_A"
        name    = "sakura-cloud-education-touch-demo.com"
      + records = []
      + ttl     = 0
        # (3 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }
  # aws_route53_record.sample_cert_validation has been changed
  ~ resource "aws_route53_record" "sample_cert_validation" {
        id      = "Z07054061YZ4SIOQH4B64__67eb6117e9f97e2a75b4417b0fa42f19.sakura-cloud-education-touch-demo.com._CNAME"
        name    = "_67eb6117e9f97e2a75b4417b0fa42f19.sakura-cloud-education-touch-demo.com"
        # (5 unchanged attributes hidden)
    }
  # aws_s3_bucket.alb_log has been changed
  ~ resource "aws_s3_bucket" "alb_log" {
        id                          = "alb-log-of-ecs-sample"
      + tags                        = {}
        # (10 unchanged attributes hidden)

      ~ lifecycle_rule {
            id                                     = "tf-s3-lifecycle-20211128084343040100000001"
          + tags                                   = {}
            # (2 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }

        # (1 unchanged block hidden)
    }
  # aws_lb.sample has been changed
  ~ resource "aws_lb" "sample" {
        id                         = "arn:aws:elasticloadbalancing:ap-northeast-1:722557045766:loadbalancer/app/sample/2aef9e53f7888967"
        name                       = "sample"
      + tags                       = {}
        # (17 unchanged attributes hidden)


        # (3 unchanged blocks hidden)
    }
  # aws_lb_target_group.sample has been changed
  ~ resource "aws_lb_target_group" "sample" {
        id                                 = "arn:aws:elasticloadbalancing:ap-northeast-1:722557045766:targetgroup/sample/2ac5a7a4fd71cf94"
        name                               = "sample"
      + tags                               = {}
        # (13 unchanged attributes hidden)


        # (2 unchanged blocks hidden)
    }
  # aws_acm_certificate.sample has been changed
  ~ resource "aws_acm_certificate" "sample" {
        id                        = "arn:aws:acm:ap-northeast-1:722557045766:certificate/697fc502-eafd-4545-9c78-5a56899f47bd"
      ~ status                    = "PENDING_VALIDATION" -> "ISSUED"
      + tags                      = {}
        # (7 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }
  # module.http_sg.aws_security_group_rule.ingress has been changed
  ~ resource "aws_security_group_rule" "ingress" {
        id                = "sgrule-1740198367"
      + ipv6_cidr_blocks  = []
      + prefix_list_ids   = []
        # (7 unchanged attributes hidden)
    }
  # module.http_sg.aws_security_group.default has been changed
  ~ resource "aws_security_group" "default" {
      ~ egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
        id                     = "sg-0be58c4f1a48c6129"
      ~ ingress                = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 80
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 80
            },
        ]
        name                   = "http-sg"
      + tags                   = {}
        # (6 unchanged attributes hidden)
    }
  # module.http_sg.aws_security_group_rule.egress has been changed
  ~ resource "aws_security_group_rule" "egress" {
        id                = "sgrule-4215454654"
      + ipv6_cidr_blocks  = []
      + prefix_list_ids   = []
        # (7 unchanged attributes hidden)
    }

Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_lb_listener.https will be created
  + resource "aws_lb_listener" "https" {
      + arn               = (known after apply)
      + certificate_arn   = "arn:aws:acm:ap-northeast-1:722557045766:certificate/697fc502-eafd-4545-9c78-5a56899f47bd"
      + id                = (known after apply)
      + load_balancer_arn = "arn:aws:elasticloadbalancing:ap-northeast-1:722557045766:loadbalancer/app/sample/2aef9e53f7888967"
      + port              = 443
      + protocol          = "HTTPS"
      + ssl_policy        = "ELBSecurityPolicy-2016-08"
      + tags_all          = (known after apply)

      + default_action {
          + order = (known after apply)
          + type  = "fixed-response"

          + fixed_response {
              + content_type = "text/plain"
              + message_body = "Not Found"
              + status_code  = "404"
            }
        }
    }

  # aws_lb_listener_rule.sample will be created
  + resource "aws_lb_listener_rule" "sample" {
      + arn          = (known after apply)
      + id           = (known after apply)
      + listener_arn = (known after apply)
      + priority     = 100
      + tags_all     = (known after apply)

      + action {
          + order            = (known after apply)
          + target_group_arn = "arn:aws:elasticloadbalancing:ap-northeast-1:722557045766:targetgroup/sample/2ac5a7a4fd71cf94"
          + type             = "forward"
        }

      + condition {

          + path_pattern {
              + values = [
                  + "/*",
                ]
            }
        }
    }

Plan: 2 to add, 0 to change, 0 to destroy.
aws_lb_listener.https: Creating...
aws_lb_listener.https: Creation complete after 2s [id=arn:aws:elasticloadbalancing:ap-northeast-1:722557045766:listener/app/sample/2aef9e53f7888967/64f5cb61d316f892]
aws_lb_listener_rule.sample: Creating...
aws_lb_listener_rule.sample: Creation complete after 2s [id=arn:aws:elasticloadbalancing:ap-northeast-1:722557045766:listener-rule/app/sample/2aef9e53f7888967/64f5cb61d316f892/176d6d7af801e373]

Apply complete! Resources: 2 added, 0 changed, 0 destroyed.

Outputs:

alb_dns_name = "sample-1357241970.ap-northeast-1.elb.amazonaws.com"
domain_name = "sakura-cloud-education-touch-demo.com"

```

</details>

<!-- github-comment: {"Command":"apply","JobName":"terraform","PRNumber":4,"Program":"tfcmt","SHA1":"84fbadec1433773747f723b5f3ecf9fa8151b57b","Vars":{},"WorkflowName":"terraform"} -->